{
  "categories" : [ {
    "name" : "Movies",
    "videos" : [ {
      "description" : "If you have just minutes and are looking for a fat burning home workout that will get your heart pumping and have you breaking a sweat in no time, then this is the routine for you. Everyone at all levels of ability can perform this home workout. Beginners, intermediate and advanced fitness levels can do this and see results without needing any equipment and without having to go to any gym.

The workout is broken down into a follow along format. This means that you can do it along with the video. Rest indicators are included for the different ability levels and previews of the home fat burning exercises coming up are shown so you know what is coming up next and can prepare for it. 

There are three major segments to this home fat burning workout. There is a lower body, upper body and core segment that are performed sequentially with only 30 seconds rest in between. The goal is to complete one round of them if you are attempting this at the beginner level, 2 rounds if attempting it at the intermediate fitness level and 3 total rounds if you are doing so at the advanced level.

If you need to rest during the period of any exercise you may be doing, you can, however it is best to try and gut it out and avoid stopping. Simply drop down to the ability level below the one you are doing it at if you are having trouble keeping up. The exercises are arranged in a way that they get easier as you move through the home workout sequence. Because there are no requirements for equipment in this no equipment bodyweight workout you should be able to transition from one to the next rather quickly.

There is a time stamped link in the pinned comment to help the intermediate and advanced trainees click back to the beginning of the workout so you can quickly repeat the second and third round.

Here are the specific exercises in this home fat burning workout.

Lower Body Segment:

Split Squat Lateral Hops x 15 sec (Beg), 20 sec (Int), 25 sec (Adv)
Ratchet Squats x 15 sec (Beg), 20 sec (Int), 25 sec (Adv)
Prisoner Walk Ups x 15 sec (Beg), 20 sec (Int), 25 sec (Adv)
Sidewinders x 30 seconds all levels

Rest 30 seconds and move onto Upper Body Segment

Upper Body Segment:

Hover Hops x 15 sec (Beg), 20 sec (Int), 25 sec (Adv)
Step Through Pushups x 15 sec (Beg), 20 sec (Int), 25 sec (Adv)
Pushup Toe Taps x 15 sec (Beg), 20 sec (Int), 25 sec (Adv)
Hover Pulses x 30 seconds all levels

Rest 30 seconds and move onto Core Segment

Core Segment:

Twisting Pistons x 15 sec (Beg), 20 sec (Int), 25 sec (Adv)
Black Widow Knee Slides x 15 sec (Beg), 20 sec (Int), 25 sec (Adv)
Lateral Mountain Climbers x 15 sec (Beg), 20 sec (Int), 25 sec (Adv)
V-Sit Pulses x 30 seconds all levels

Remember, your goal is to make it through the entire workout without having to rest at all during any of the exercise periods. This doesn’t mean that you should stop if you do. Just keep trying to get back in there as quickly as you can and, as your stamina improves, you will find that you will be able to do the entire home fat burning workout unbroken.

This home workout takes about 15 minutes you perform it at the intermediate level, 8 minutes if done at the beginner level and 22 minutes or so if you do it at the advanced level.

Keep attempting to move up a level if you are easily completing it at the current one.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FCardio%2F15%20Minute%20Fat%20Burning%20Home%20Workout%20(NO%20EQUIPMENT!).mp4?alt=media&token=12911278-8690-4677-be40-ba787e7f4606" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/thumbnailcardio.jpg?alt=media&token=4ae01873-c920-4b50-b8a2-53d01f8af267",
      "title" : "15 Minute Fat Burning Home Workout"
    }, {
      "description" : "A fat loss workout is often not as effective as it should be because it commits one of two programming sins.  The first is scaling the fat burning workouts by time, to match the ability level of the person performing it.  The second, is compromising the difficulty level of the exercise selected to make sure everyone can do the workout.

In this video, I’m going to show you a much better way to lose fat by avoiding these two common fat loss workout mistakes.  It starts with an explanation on the technique of choosing a workout that is longer for the more advanced users and shorter for the less advanced.  The mistake here is that you are compromising the minutes of effort that the person who is likely more in need of the program in the first place, is doing.

Think about it.  If you are a beginner you likely have more fat to lose than someone who is more advanced in their training.  Making the beginner do only 30 seconds of work versus someone more advanced who may be doing 2 minutes is severely cutting into the amount of seconds of effort that is being put forth by that person.  This is going to have the end result of having the beginner do far less work and burn far fewer calories than those performing the work for longer.

The next thing that happens is, those that program fat loss workouts this way, realize that in order for this to be the case they program the same exercise for each.  This compromises the level of difficulty of the exercise chosen so that it is still possible for the beginner to do it, while often times not being challenging enough for the more advanced.

Both of these mistakes can be corrected by training in the Shred zone.  The new Max Shred program from ATHLEAN-X shows you how to not just match the trainee with an exercise variation that is going to challenge them the most and therefore help them burn more calories, but to ensure everyone is working for the same amount of time.

In this video, I show you a 6 minute fat loss workout that you can do regardless of whether you are a beginner, intermediate or advanced trainee.  The key is that everyone is going to perform each of the three rounds listed for 2 minutes at a time.  The advanced will try and do the advanced exercises for the entire duration of the 2 minutes.  The intermediate will attempt to start with the advanced exercises and then drop down when needed to be able to complete the 2 minutes.  The beginners will attempt to do the intermediate exercise for as long as possible before dropping down.

The exercises chosen here are done so to ensure high effort is being exerted.  Not just that, but these exercises get more metabolically demanding as they require more muscle groups to participate in order to ensure you do them properly.  This results in more caloric burn and more bang from your buck.  This means, shorter more intense workouts that burn fat faster.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FCardio%2F6%20Minute%20Fat%20Loss%20Workout%20(BEGINNER%20INT%20ADVANCED).mp4?alt=media&token=f5d73b5c-cbfa-44fb-9bf1-20094cc57b41" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/thumbnailcardio2.jpg?alt=media&token=390c3e03-9820-4fe7-a617-bfc43ab2c6a0",
      "title" : "6 Minute Fat Loss Workout"
    },{
      "description" : "Having a morning fat burning workout that doesn’t take a lot of time and can work your full body quickly is helpful in giving you the best chance at fat loss. Consistency of exercise and good nutrition is the only way to burn fat by putting your body in a hypocaloric state. There are many videos on my channel showing you the importance of a good diet for consuming fewer calories, however in this one I am going to give you a step by step cardio workout to burn calories and fat quickly.

If you are a beginner, you can choose to do this entire workout with either no weights at all or with a very light 5 pound dumbbell. If you are novice to intermediate you can increase the weight used to 10, 15 or even 20 pounds. If you are advanced you can use a dumbbell for this fat burning workout that weighs 25 pounds or more.

The workout itself takes just 4 minutes per round.

If you are short on time but still want to get in a killer fat torching workout before you head out in the morning, then you can aim for just a single round. If you have more time, take 3 minutes of rest between completed rounds and attempt to complete a total of 3 or 4. You may have to drop the weight used between each subsequent round to ensure that you are fatiguing from the conditioning effect and not because you don’t have the strength to perform the weighted exercises.

Here is how this morning fat burning workout breaks down exercise by exercise:

1. Lunge Cleans x 30 seconds to the right
2. Lunge Cleans x 30 seconds to the left
3. 1-Arm Swings x 30 seconds right arm
4. 1-Arm Swings x 30 seconds left arm
5. Russian Presses x 30 seconds to the right side
6. Russian Presses x 30 seconds to the left side
7. Renegade Row Ups x 30 seconds right arm
8. Renegade Row Ups x 30 seconds left arm

You may rest up to 20 seconds between completed exercises. The goal would be to keep the rest as short as possible however to keep the conditioning effect high while giving you just enough time to transition to the next movement. Keep in mind, if you are breathing so hard that you are not effectively doing the exercises in good form then it is more important that you take more time and perform them safely.

The key to this fat burning workout at home is that you don’t need a lot of equipment to get it done. You can do this with just a single dumbbell in just a small amount of space. None of the movements are very difficult to perform with just a little practice. Also, with this being a full body fat loss workout you are getting the benefit of working many muscles in a short period of time to help you increase the amount of calories that you will burn doing it.

Home fat burning workouts are essential now more than ever. Maybe you can’t get to the gym but still want to have a way to burn off excess calories and lose body fat. Well, this is a convenient option for getting the job done without having to leave the house or have a gym membership.r

Fast fat loss is possible when you combine both a consistency in your workouts along with a sound approach to your nutrition. Try to avoid crash diets. While they may appear tempting because of the fast fat burning results that those trying to sell them to you are promising, you likely will wind up in the long run putting the weight back on and not permanently losing fat.

Instead, make the small changes needed to gain consistency. This 4 minute fat burning workout is something that anyone can try. Again, even if you are a beginner you can do this fat loss workout by dropping the weight entirely and just going at the pace that you can handle. The key is, if you are able to repeat the 4 minute workout every day for a few weeks, you not only will start seeing the fat loss but you will be ingraining the habit of exercise into your daily routine.

Combine that with a much improved focus on eating good foods, and taking in fewer calories as a result, and you have the fat loss workout and diet that you’ve been waiting for.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FCardio%2F4%20MIN%20Morning%20Fat%20Burning%20Workout%20(BURN%20FAT%20FAST!).mp4?alt=media&token=5c675438-f3ae-4061-a9f4-e39b0c6cb39d" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/thumbnailcardio3.jpg?alt=media&token=cacdc469-49c5-45e7-a126-38f61c2f6981",
      "title" : "4 MIN Morning Fat Burning Workout"
    } ]
  } ]
}
